<%@ Page Title="" Language="C#" MasterPageFile="~/Accounting/Accounting.master" AutoEventWireup="true" CodeBehind="Default.aspx.cs" Inherits="Portal.Accounting.Default" %>

<asp:Content ID="Content1" ContentPlaceHolderID="AccountingBody" runat="server">
	<%if (Portal.Telegram.Telegram.TelegramUserID >= 1)
   { %>
	<script type="text/javascript">

		var messsystem = "<%=Tools.Tools.GetSetting(445, "")%>";
		if (messsystem != "")
			jAlert(messsystem, 'پیام سیستم');
	</script>
	<%} %>
	<%=Tools.Template.GetCadr(Tools.Template.CadrItem.CadrBeforTitle,0)%>
	<%=HttpContext.GetGlobalResourceObject("resource", "TelegramDefault").ToString()%>
	<%=Tools.Template.GetCadr(Tools.Template.CadrItem.CadrAfterTitle,0)%>
	<div style="margin: 0 auto; width: 700px;">
		<img src="/Images/Telegram/robot.jpg" /></div>
	<%if (Portal.Telegram.Telegram.TelegramUserID < 1)
   { %>
	<div style="margin: 0 auto; width: 740px;">
		<a href="/Accounting/Logins.aspx">
			<img src="/Images/Telegram/login.png" alt="ورود به سیستم تلگرام" style="margin: 5px;" />
		</a>
		<a href="/Accounting/Register.aspx">
			<img src="/Images/Telegram/sign.png" alt="عضویت در سیتم تلگرام" style="margin: 5px;" />
		</a>
		
	</div>
	<%} %>
	<div class="TelegramComment">ربات تلگرام چیست و ربات ساز تلگرام چیست؟ </div>
	<div class="TelgramDef">
		<h2>ربات تلگرام چیست؟</h2>

		ربات تلگرام نوعی حساب کاربری ویژه است که برای ارسال و دریافت اتوماتیک پیام طراحی شده است. کاربران میتوانند با ارسال دستورات گوناگون با ربات های تلگرام در ارتباط باشند، این ارتباط میتواند در یک مکالمه شخصی و یا در یک گروه ایجاد شود. شما میتوانید ربات خود را با استفاده از API تلگرام و از طریق درخواست های HTTPS مدیریت کنید.
	<div style="text-align:center;width:100%;">	<a href="/Images/Telegram/kat.jpg" target="_blank"">
	<img src="/Images/Telegram/kat.jpg" alt="کاتالوگ سیستم تلگرام" title="کاتالوگ سیستم تلگرام" style="margin:0 auto;width:400px;" /></a></div>
		<h2>امنیت ربات تلگرام برای کاربران چگونه است؟</h2>
		
			بر خلاف نظر عموم جامعه ربات تلگرام هیچگونه دسترسی به گوشی و اطلاعات شخصی افراد استفاده کننده از ربات را ندارد. فقط به اطلاعاتی می تواند دسترسی داشته باشد که شما برای ربات ارسال می کنید. در غیر اینصورت مانند یک گفتگو دوطرفه بین شما و یکی از دوستانتان می باشد و فرق آن این است که جواب دهنده شما یک سیستم هوشمند می باشد و پاسخ شما را ارسال می نماید.
		<h2>تفاوت های ربات تلگرام با افراد</h2>

				ربات ها آخرین زمان آنلاین بودن ندارند و همیشه عبارت bot در انتهای نام کاربری آنها نمایش داده میشود.
		ربات تلگرام نمیتواند شروع کننده مکالمه با کاربران باشد، تنها زمانیکه کاربر ربات را به گروه اضافه کند یا به آن پیام بفرستد امکان ارسال پیام از طرف ربات وجود خواهد داشت.
		با اضافه شدن ربات به گروه، همه پیام ها توسط ربات دریافت و تحلیل نمیشود مگر آنکه تنظیمات آن را تغییر داده باشید.
		ربات های تلگرام هرگز غیرفعال، آفلاین یا خسته نمیشوند!

		<h2>کاربردهای ربات تلگرام</h2>
		در واقع میتوان گفت که ربات تلگرام میتواند هر کاربردی داشته باشد! نحوه استفاده از آنها به خلاقیت شما و الگوریتم هایی که برای آن تعریف میکنید بستگی دارد. برخی از کاربردهای آنها به شرح زیر است:<br>
		ارتباط با وب سرویس ها: یک ربات تلگرام میتواند فعالیت های شما را کوتاه و بهینه کند، بعنوان مثال شما میتوانید هر زمان دیدگاه یا فرم تماس جدیدی در سایت ارسال شد، مستقیما در تلگرام آن را دریافت کنید. و یا آخرین ایمیل های خود را به حساب تلگرام خود منتقل کنید.<br>
		ساخت بازی های فکری ساده: نحوه ارتباط شما با ربات تلگرام از طریق API این قابلیت را ایجاد میکند که به سرعت پاسخ های کاربران را تحلیل کرده و نتایج متناسب با آن را برایشان ارسال کنید. این قابلیت به شما امکان میدهد بازی های گوناگونی را طراحی و پیاده سازی نمایید.<br>
		ابزارهای کاربردی: ربات تلگرام میتواند هر کاربردی داشته باشد، شما هستید که کارایی آن را طرح ریزی میکنید. دریافت نرخ ارز، اطلاعات هواشناسی، اخبار روز و تفریح و سرگرمی هرکدام نمونه های موفقی از کاربرد ربات تلگرام هستند.<br>
		<h2>ربات ساز تلگرام چیست؟</h2>
		کارشناسان این مجموعه بر آن شدند سیستمی طراحی و تحلیل و پیاده سازی نمایند که کاربرانی که توانایی ساخت رباط ندارند به صورت بسیار ساده و با زدن چند کلیک بتوانند ربات مورد نظر خود را طراحی و ارائه خدمات نمایند. به عنوان مثال یک فروشگاه می تواند محصولات خود را جهت فروش ارائه نماید و یا ....<br />
		راهنمای ربات ساز تلگرام در <a href="http://www.imencms.com/Telegram/TelegramHelp.pdf" target="_blank">این آدرس</a> می توانید دریافت کرده و استفاده نمایید. این راهنما به افرادی که می خواهند برای خود ربات بسازند نیز راهنمای کافی را دارد
		<h2>نمونه ربات ساخته شده با این سیستم</h2>
		در صورتی که می خواهید نمونه ای از ربات ساحته شده تلگرام را ببینید می توانید به سیستم ربات ایمن سی ام اس پیام دهید و سیستم را به طور کامل ببینید.<br />
		برای این کار لازم است ابتدا به کاربر @ImenCMSBot پیام دهید. کافیست بر روی لینک زیر کلیک کنید و لینک ارسالی را با نرم افزار تلگرام باز کنید.<br />
		<a href="https://telegram.me/imencmsbot" target="_blank">https://telegram.me/imencmsbot</a><br />
		در ابتدا با زدن دکمه استارت (/Start) کار با سیستم شروع شده و منوی کاربری مشاهده می گردد
		<div  dir="rtl" style="width:780px;margin:0 auto"><img src="/Images/Telegram/sam1.jpg" alt="نمونه ربات طراحی شده با سیستم ایمن" title="نمونه ربات طراحی شده با سیستم ایمن"/>
			<img src="/Images/Telegram/sam2.jpg" alt="نمونه ربات طراحی شده با سیستم ایمن" title="نمونه ربات طراحی شده با سیستم ایمن"/>
			<img src="/Images/Telegram/sam3.jpg" alt="نمونه ربات طراحی شده با سیستم ایمن" title="نمونه ربات طراحی شده با سیستم ایمن"/>
			<img src="/Images/Telegram/sam4.jpg" alt="نمونه ربات طراحی شده با سیستم ایمن" title="نمونه ربات طراحی شده با سیستم ایمن"/>
			<img src="/Images/Telegram/sam4.jpg" alt="نمونه ربات طراحی شده با سیستم ایمن" title="نمونه ربات طراحی شده با سیستم ایمن"/>
			<img src="/Images/Telegram/sam6.jpg" alt="نمونه ربات طراحی شده با سیستم ایمن" title="نمونه ربات طراحی شده با سیستم ایمن"/>
		</div>

	
	</div>
	<div style="clear: both"></div>
</asp:Content>
